Script started on Mon 18 Feb 2013 02:18:15 AM PST
]0;lhw@pc4:~/gdb[lhw@pc4 ~/gdb]$ gdb a.out
[?1034hGNU gdb (GDB) Fedora (7.4.50.20120120-54.fc17)
Copyright (C) 2012 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /home/lhw/gdb/a.out...done.
(gdb) h
List of classes of commands:

aliases -- Aliases of other commands
breakpoints -- Making program stop at certain points
data -- Examining data
files -- Specifying and examining files
internals -- Maintenance commands
obscure -- Obscure features
running -- Running the program
stack -- Examining the stack
status -- Status inquiries
support -- Support facilities
tracepoints -- Tracing of program execution without stopping the program
user-defined -- User-defined commands

Type "help" followed by a class name for a list of commands in that class.
Type "help all" for the list of all commands.
Type "help" followed by command name for full documentation.
Type "apropos word" to search for commands related to "word".
Command name abbreviations are allowed if unambiguous.
(gdb) r
Starting program: /home/lhw/gdb/a.out 
Enter upper bound:
20

Program received signal SIGSEGV, Segmentation fault.
0x4ec5a6b1 in _IO_vfscanf_internal () from /lib/libc.so.6
Missing separate debuginfos, use: debuginfo-install glibc-2.15-58.fc17.i686
(gdb) bt
#0  0x4ec5a6b1 in _IO_vfscanf_internal () from /lib/libc.so.6
#1  0x4ec6837f in __isoc99_scanf () from /lib/libc.so.6
#2  0x080484aa in main () at main.c:17
(gdb) k
Kill the program being debugged? (y or n) y
(gdb) q
]0;lhw@pc4:~/gdb[lhw@pc4 ~/gdb]$ gdb a.out core
[?1034hGNU gdb (GDB) Fedora (7.4.50.20120120-54.fc17)
Copyright (C) 2012 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /home/lhw/gdb/a.out...done.
[New LWP 13058]
Core was generated by `a.out'.
Program terminated with signal 11, Segmentation fault.
#0  0x4ec5a6b1 in _IO_vfscanf_internal () from /lib/libc.so.6
Missing separate debuginfos, use: debuginfo-install glibc-2.15-58.fc17.i686
(gdb) bt
#0  0x4ec5a6b1 in _IO_vfscanf_internal () from /lib/libc.so.6
#1  0x4ec6837f in __isoc99_scanf () from /lib/libc.so.6
#2  0x080484aa in main () at main.c:17
(gdb) l 17
12	int main()
13	{
14	  int i;
15	
16	  printf("Enter upper bound:\n");
17	  scanf("%d", UpperBound);
18	
19	  Prime[1] = 1;
20	  Prime[2] = 1;
21	
(gdb) l main.c:17
12	int main()
13	{
14	  int i;
15	
16	  printf("Enter upper bound:\n");
17	  scanf("%d", UpperBound);
18	
19	  Prime[1] = 1;
20	  Prime[2] = 1;
21	
(gdb) l main
8	
9	int Prime[50],  /* Prime[i] will be 1 if i is prime, 0 otherwise */
10	UpperBound; /* check all number up through this one for primeness */
11	
12	int main()
13	{
14	  int i;
15	
16	  printf("Enter upper bound:\n");
17	  scanf("%d", UpperBound);
(gdb) r
warning: exec file is newer than core file.
`/home/lhw/gdb/a.out' has changed; re-reading symbols.
warning: exec file is newer than core file.
Starting program: /home/lhw/gdb/a.out 
Enter upper bound:
20

Program received signal SIGSEGV, Segmentation fault.
0x08048534 in CheckPrime (K=3, Prime=0x80498a0) at prime.c:13
13	    if (Prime[J] == 1)
Missing separate debuginfos, use: debuginfo-install glibc-2.15-58.fc17.i686
(gdb) p J
$1 = 34264
(gdb) l Check  Prime  
1	void CheckPrime(int K, int Prime[])
2	{
3	  int J;
4	
5	  /* the plan:  see if J divides K, for all values J which are
6	      (a) themselves prime (no need to try J if it is nonprime), and
7	      (b) less than or equal to sqrt(K) (if K has a divisor larger
8	          than this square root, it must also have a smaller one,
9	          so no need to check for larger ones) */
10	
(gdb) 
11	  J = 1;
12	  while (1)  {
13	    if (Prime[J] == 1)
14	      if (J % K == 0)  {
15	        Prime[K] = 0;
16	        return;
17	      } /* if */
18	    J++;
19	  } /* while */
20	
(gdb) k
Kill the program being debugged? (y or n) y
(gdb) r
Starting program: /home/lhw/gdb/a.out 
Enter upper bound:
^C
Program received signal SIGINT, Interrupt.
0xb7fff424 in __kernel_vsyscall ()
(gdb) w k
Kill the program being debugged? (y or n) y
(gdb) r
`/home/lhw/gdb/a.out' has changed; re-reading symbols.
Starting program: /home/lhw/gdb/a.out 
Enter upper bound:
20
[Inferior 1 (process 13572) exited normally]
Missing separate debuginfos, use: debuginfo-install glibc-2.15-58.fc17.i686
(gdb) b main 
Breakpoint 1 at 0x8048489: file main.c, line 16.
(gdb) r
Starting program: /home/lhw/gdb/a.out 

Breakpoint 1, main () at main.c:16
16	  printf("Enter upper bound:\n");
(gdb) n
Enter upper bound:
17	  scanf("%d", &UpperBound);
(gdb) n
20
19	  Prime[1] = 1;
(gdb) s
20	  Prime[2] = 1;
(gdb) s
22	  for (i = 3; i <= UpperBound; i += 2) {
(gdb) s
23	    CheckPrime(i, Prime);
(gdb) n
24	    if (Prime[i]) 
(gdb) s
22	  for (i = 3; i <= UpperBound; i += 2) {
(gdb) p Prie m  e[]3]]
$2 = 0
(gdb) b Check  Prime  
Breakpoint 2 at 0x804851e: file prime.c, line 11.
(gdb) k
Kill the program being debugged? (y or n) y
(gdb) r
Starting program: /home/lhw/gdb/a.out 

Breakpoint 1, main () at main.c:16
16	  printf("Enter upper bound:\n");
(gdb) c
Continuing.
Enter upper bound:
20

Breakpoint 2, CheckPrime (K=3, Prime=0x80498a0) at prime.c:11
11	  J = 1;
(gdb) disp J
1: J = 0
(gdb) s
13	    if (Prime[J] == 1)
1: J = 1
(gdb) s
14	      if (K % J == 0)  {
1: J = 1
(gdb) s
15	        Prime[K] = 0;
1: J = 1
(gdb) s
16	        return;
1: J = 1
(gdb) ub  ub   n  disp l
warning: bad display number at or near 'l'
(gdb) k
Kill the program being debugged? (y or n) y
(gdb) d 1
(gdb) r
`/home/lhw/gdb/a.out' has changed; re-reading symbols.
Starting program: /home/lhw/gdb/a.out 
Enter upper bound:
10  20

Breakpoint 2, CheckPrime (K=3, Prime=0x80498a0) at prime.c:11
11	  J = 2;
Missing separate debuginfos, use: debuginfo-install glibc-2.15-58.fc17.i686
(gdb) c
Continuing.

Program received signal SIGSEGV, Segmentation fault.
0x08048534 in CheckPrime (K=3, Prime=0x80498a0) at prime.c:13
13	    if (Prime[J] == 1)
(gdb) p J
$3 = 34264
(gdb) k
Kill the program being debugged? (y or n) y
(gdb) d
Delete all breakpoints? (y or n) y
(gdb) r
`/home/lhw/gdb/a.out' has changed; re-reading symbols.
Starting program: /home/lhw/gdb/a.out 
Enter upper bound:
20
3 is a prime
5 is a prime
7 is a prime
11 is a prime
13 is a prime
17 is a prime
19 is a prime
[Inferior 1 (process 13701) exited normally]
Missing separate debuginfos, use: debuginfo-install glibc-2.15-58.fc17.i686
(gdb) q
]0;lhw@pc4:~/gdb[lhw@pc4 ~/gdb]$ exit
exit

Script done on Mon 18 Feb 2013 02:32:37 AM PST
